; domain
(define (domain joust-circuit)
(:requirements :strips :typing)
(:types arena competitor rank - object
  keep pavilion - arena
  knight trophy - competitor)

(:predicates (carried ?g - trophy ?t - knight ?l - rank)
       (for-claim ?g - trophy ?m - pavilion ?l - rank)
       (kept ?g - trophy ?l - rank)
       (offered ?g - trophy ?m -  pavilion ?l - rank)
       (succeeds ?l1 ?l2 - rank)
       (posted-at ?t - knight ?p - arena)
       (linked-to ?p1 ?p2 - arena))

(:action ride
 :parameters (?t - knight ?from ?to - arena)
 :precondition (and (posted-at ?t ?from) (linked-to ?from ?to))
 :effect (and (not (posted-at ?t ?from)) (posted-at ?t ?to)))

; ### LOAD ###
; ?l1 is the level of ?g ready to be loaded at ?m before loading
; ?l2 is the level of ?g ready to be loaded at ?m after loading
; ?l3 is the level of ?g in ?t before loading
; ?l4 is the level of ?g in ?t after loading

(:action claim
 :parameters (?g - trophy ?t - knight ?m - pavilion ?l1 ?l2 ?l3 ?l4 - rank)
 :precondition (and (posted-at ?t ?m) (carried ?g ?t ?l3)
        (for-claim ?g ?m ?l2) (succeeds ?l2 ?l1) (succeeds ?l4 ?l3))
 :effect (and (carried ?g ?t ?l4) (not (carried ?g ?t ?l3))
        (for-claim ?g ?m ?l1) (not (for-claim ?g ?m ?l2))))


; ### UNLOAD ###
; ?l1 is the level of ?g in ?t before unloading
; ?l2 is the level of ?g in ?t after unloading
; ?l3 is the level of ?g in ?d before unloading
; ?l4 is the level of ?g in ?d after unloading

(:action stash
 :parameters (?g - trophy ?t - knight ?d - keep ?l1 ?l2 ?l3 ?l4 - rank)
 :precondition (and (posted-at ?t ?d) (carried ?g ?t ?l2)
        (kept ?g ?l3) (succeeds ?l2 ?l1) (succeeds ?l4 ?l3))
 :effect (and (carried ?g ?t ?l1) (not (carried ?g ?t ?l2))
        (kept ?g ?l4) (not (kept ?g ?l3))))


; ### BUY ###
; ?l1 is the level of ?g on sale at ?m before buying
; ?l2 is the level of ?g on sale at ?m after buying
; ?l3 is the level of ?g ready to be loaded at ?m before buying
; ?l4 is the level of ?g ready to be loaded at ?m after buying

(:action seize
 :parameters (?t - knight ?g - trophy ?m - pavilion ?l1 ?l2 ?l3 ?l4 - rank)
 :precondition (and (posted-at ?t ?m) (offered ?g ?m ?l2) (for-claim ?g ?m ?l3)
        (succeeds ?l2 ?l1) (succeeds ?l4 ?l3))
 :effect (and (offered ?g ?m ?l1) (not (offered ?g ?m ?l2))
        (for-claim ?g ?m ?l4) (not (for-claim ?g ?m ?l3))))
)

; problem
; Domain designed by Alfonso Gerevini and Alessandro Saetti
; This file has been automatically generated by the generator available from
; http://zeus.ing.unibs.it/ipc-5/generators/index.html

(define (problem joust-circuit-p05)
(:domain joust-circuit)
(:objects
  trophy1 trophy2 trophy3 trophy4 trophy5 - trophy
  knight1 knight2 knight3 - knight
  pavilion1 pavilion2 pavilion3 - pavilion
  keep1 keep2 keep3 - keep
  rank0 rank1 rank2 rank3 - rank)

(:init
  (succeeds rank1 rank0)
  (succeeds rank2 rank1)
  (succeeds rank3 rank2)
  (for-claim trophy1 pavilion1 rank0)
  (for-claim trophy1 pavilion2 rank0)
  (for-claim trophy1 pavilion3 rank0)
  (for-claim trophy2 pavilion1 rank0)
  (for-claim trophy2 pavilion2 rank0)
  (for-claim trophy2 pavilion3 rank0)
  (for-claim trophy3 pavilion1 rank0)
  (for-claim trophy3 pavilion2 rank0)
  (for-claim trophy3 pavilion3 rank0)
  (for-claim trophy4 pavilion1 rank0)
  (for-claim trophy4 pavilion2 rank0)
  (for-claim trophy4 pavilion3 rank0)
  (for-claim trophy5 pavilion1 rank0)
  (for-claim trophy5 pavilion2 rank0)
  (for-claim trophy5 pavilion3 rank0)
  (kept trophy1 rank0)
  (kept trophy2 rank0)
  (kept trophy3 rank0)
  (kept trophy4 rank0)
  (kept trophy5 rank0)
  (carried trophy1 knight1 rank0)
  (carried trophy1 knight2 rank0)
  (carried trophy1 knight3 rank0)
  (carried trophy2 knight1 rank0)
  (carried trophy2 knight2 rank0)
  (carried trophy2 knight3 rank0)
  (carried trophy3 knight1 rank0)
  (carried trophy3 knight2 rank0)
  (carried trophy3 knight3 rank0)
  (carried trophy4 knight1 rank0)
  (carried trophy4 knight2 rank0)
  (carried trophy4 knight3 rank0)
  (carried trophy5 knight1 rank0)
  (carried trophy5 knight2 rank0)
  (carried trophy5 knight3 rank0)
  (linked-to pavilion1 pavilion3)
  (linked-to pavilion2 pavilion3)
  (linked-to pavilion3 pavilion1)
  (linked-to pavilion3 pavilion2)
  (linked-to keep1 pavilion2)
  (linked-to pavilion2 keep1)
  (linked-to keep2 pavilion2)
  (linked-to pavilion2 keep2)
  (linked-to keep3 pavilion1)
  (linked-to pavilion1 keep3)
  (offered trophy1 pavilion1 rank3)
  (offered trophy2 pavilion1 rank3)
  (offered trophy3 pavilion1 rank3)
  (offered trophy4 pavilion1 rank1)
  (offered trophy5 pavilion1 rank3)
  (offered trophy1 pavilion2 rank0)
  (offered trophy2 pavilion2 rank0)
  (offered trophy3 pavilion2 rank0)
  (offered trophy4 pavilion2 rank0)
  (offered trophy5 pavilion2 rank0)
  (offered trophy1 pavilion3 rank0)
  (offered trophy2 pavilion3 rank0)
  (offered trophy3 pavilion3 rank0)
  (offered trophy4 pavilion3 rank0)
  (offered trophy5 pavilion3 rank0)
  (posted-at knight1 keep3)
  (posted-at knight2 keep2)
  (posted-at knight3 keep2))

(:goal (and
  (kept trophy1 rank2)
  (kept trophy2 rank3)
  (kept trophy3 rank1)
  (kept trophy4 rank1)
  (kept trophy5 rank1)))

)

; plan
1. (ride knight1 keep3 pavilion1)
   deleted: (posted-at knight1 keep3)
   added: (posted-at knight1 pavilion1)
   goals met: 0 of 5
2. (seize knight1 trophy5 pavilion1 rank2 rank3 rank0 rank1)
   deleted: (offered trophy5 pavilion1 rank3) (for-claim trophy5 pavilion1 rank0)
   added: (offered trophy5 pavilion1 rank2) (for-claim trophy5 pavilion1 rank1)
   goals met: 0 of 5
3. (claim trophy5 knight1 pavilion1 rank0 rank1 rank0 rank1)
   deleted: (carried trophy5 knight1 rank0) (for-claim trophy5 pavilion1 rank1)
   added: (carried trophy5 knight1 rank1) (for-claim trophy5 pavilion1 rank0)
   goals met: 0 of 5
4. (seize knight1 trophy4 pavilion1 rank0 rank1 rank0 rank1)
   deleted: (offered trophy4 pavilion1 rank1) (for-claim trophy4 pavilion1 rank0)
   added: (offered trophy4 pavilion1 rank0) (for-claim trophy4 pavilion1 rank1)
   goals met: 0 of 5
5. (claim trophy4 knight1 pavilion1 rank0 rank1 rank0 rank1)
   deleted: (carried trophy4 knight1 rank0) (for-claim trophy4 pavilion1 rank1)
   added: (carried trophy4 knight1 rank1) (for-claim trophy4 pavilion1 rank0)
   goals met: 0 of 5
6. (seize knight1 trophy3 pavilion1 rank2 rank3 rank0 rank1)
   deleted: (offered trophy3 pavilion1 rank3) (for-claim trophy3 pavilion1 rank0)
   added: (offered trophy3 pavilion1 rank2) (for-claim trophy3 pavilion1 rank1)
   goals met: 0 of 5
7. (claim trophy3 knight1 pavilion1 rank0 rank1 rank0 rank1)
   deleted: (carried trophy3 knight1 rank0) (for-claim trophy3 pavilion1 rank1)
   added: (carried trophy3 knight1 rank1) (for-claim trophy3 pavilion1 rank0)
   goals met: 0 of 5
8. (seize knight1 trophy2 pavilion1 rank2 rank3 rank0 rank1)
   deleted: (offered trophy2 pavilion1 rank3) (for-claim trophy2 pavilion1 rank0)
   added: (offered trophy2 pavilion1 rank2) (for-claim trophy2 pavilion1 rank1)
   goals met: 0 of 5
9. (seize knight1 trophy1 pavilion1 rank2 rank3 rank0 rank1)
   deleted: (offered trophy1 pavilion1 rank3) (for-claim trophy1 pavilion1 rank0)
   added: (offered trophy1 pavilion1 rank2) (for-claim trophy1 pavilion1 rank1)
   goals met: 0 of 5
10. (ride knight1 pavilion1 keep3)
   deleted: (posted-at knight1 pavilion1)
   added: (posted-at knight1 keep3)
   goals met: 0 of 5
11. (stash trophy5 knight1 keep3 rank0 rank1 rank0 rank1)
   deleted: (carried trophy5 knight1 rank1) (kept trophy5 rank0)
   added: (carried trophy5 knight1 rank0) (kept trophy5 rank1)
   goals met: 1 of 5
12. (stash trophy4 knight1 keep3 rank0 rank1 rank0 rank1)
   deleted: (carried trophy4 knight1 rank1) (kept trophy4 rank0)
   added: (carried trophy4 knight1 rank0) (kept trophy4 rank1)
   goals met: 2 of 5
13. (stash trophy3 knight1 keep3 rank0 rank1 rank0 rank1)
   deleted: (carried trophy3 knight1 rank1) (kept trophy3 rank0)
   added: (carried trophy3 knight1 rank0) (kept trophy3 rank1)
   goals met: 3 of 5
14. (ride knight1 keep3 pavilion1)
   deleted: (posted-at knight1 keep3)
   added: (posted-at knight1 pavilion1)
   goals met: 3 of 5
15. (claim trophy1 knight1 pavilion1 rank0 rank1 rank0 rank1)
   deleted: (carried trophy1 knight1 rank0) (for-claim trophy1 pavilion1 rank1)
   added: (carried trophy1 knight1 rank1) (for-claim trophy1 pavilion1 rank0)
   goals met: 3 of 5
16. (ride knight1 pavilion1 keep3)
   deleted: (posted-at knight1 pavilion1)
   added: (posted-at knight1 keep3)
   goals met: 3 of 5
17. (stash trophy1 knight1 keep3 rank0 rank1 rank0 rank1)
   deleted: (carried trophy1 knight1 rank1) (kept trophy1 rank0)
   added: (carried trophy1 knight1 rank0) (kept trophy1 rank1)
   goals met: 3 of 5
18. (ride knight1 keep3 pavilion1)
   deleted: (posted-at knight1 keep3)
   added: (posted-at knight1 pavilion1)
   goals met: 3 of 5
19. (seize knight1 trophy1 pavilion1 rank1 rank2 rank0 rank1)
   deleted: (offered trophy1 pavilion1 rank2) (for-claim trophy1 pavilion1 rank0)
   added: (offered trophy1 pavilion1 rank1) (for-claim trophy1 pavilion1 rank1)
   goals met: 3 of 5
20. (claim trophy1 knight1 pavilion1 rank0 rank1 rank0 rank1)
   deleted: (carried trophy1 knight1 rank0) (for-claim trophy1 pavilion1 rank1)
   added: (carried trophy1 knight1 rank1) (for-claim trophy1 pavilion1 rank0)
   goals met: 3 of 5
21. (ride knight1 pavilion1 keep3)
   deleted: (posted-at knight1 pavilion1)
   added: (posted-at knight1 keep3)
   goals met: 3 of 5
22. (stash trophy1 knight1 keep3 rank0 rank1 rank1 rank2)
   deleted: (carried trophy1 knight1 rank1) (kept trophy1 rank1)
   added: (carried trophy1 knight1 rank0) (kept trophy1 rank2)
   goals met: 4 of 5
23. (ride knight1 keep3 pavilion1)
   deleted: (posted-at knight1 keep3)
   added: (posted-at knight1 pavilion1)
   goals met: 4 of 5
24. (claim trophy2 knight1 pavilion1 rank0 rank1 rank0 rank1)
   deleted: (carried trophy2 knight1 rank0) (for-claim trophy2 pavilion1 rank1)
   added: (carried trophy2 knight1 rank1) (for-claim trophy2 pavilion1 rank0)
   goals met: 4 of 5
25. (ride knight1 pavilion1 keep3)
   deleted: (posted-at knight1 pavilion1)
   added: (posted-at knight1 keep3)
   goals met: 4 of 5
26. (stash trophy2 knight1 keep3 rank0 rank1 rank0 rank1)
   deleted: (carried trophy2 knight1 rank1) (kept trophy2 rank0)
   added: (carried trophy2 knight1 rank0) (kept trophy2 rank1)
   goals met: 4 of 5
27. (ride knight1 keep3 pavilion1)
   deleted: (posted-at knight1 keep3)
   added: (posted-at knight1 pavilion1)
   goals met: 4 of 5
28. (seize knight1 trophy2 pavilion1 rank1 rank2 rank0 rank1)
   deleted: (offered trophy2 pavilion1 rank2) (for-claim trophy2 pavilion1 rank0)
   added: (offered trophy2 pavilion1 rank1) (for-claim trophy2 pavilion1 rank1)
   goals met: 4 of 5
29. (claim trophy2 knight1 pavilion1 rank0 rank1 rank0 rank1)
   deleted: (carried trophy2 knight1 rank0) (for-claim trophy2 pavilion1 rank1)
   added: (carried trophy2 knight1 rank1) (for-claim trophy2 pavilion1 rank0)
   goals met: 4 of 5
30. (ride knight1 pavilion1 keep3)
   deleted: (posted-at knight1 pavilion1)
   added: (posted-at knight1 keep3)
   goals met: 4 of 5
31. (stash trophy2 knight1 keep3 rank0 rank1 rank1 rank2)
   deleted: (carried trophy2 knight1 rank1) (kept trophy2 rank1)
   added: (carried trophy2 knight1 rank0) (kept trophy2 rank2)
   goals met: 4 of 5
32. (ride knight1 keep3 pavilion1)
   deleted: (posted-at knight1 keep3)
   added: (posted-at knight1 pavilion1)
   goals met: 4 of 5
33. (seize knight1 trophy2 pavilion1 rank0 rank1 rank0 rank1)
   deleted: (offered trophy2 pavilion1 rank1) (for-claim trophy2 pavilion1 rank0)
   added: (offered trophy2 pavilion1 rank0) (for-claim trophy2 pavilion1 rank1)
   goals met: 4 of 5
34. (claim trophy2 knight1 pavilion1 rank0 rank1 rank0 rank1)
   deleted: (carried trophy2 knight1 rank0) (for-claim trophy2 pavilion1 rank1)
   added: (carried trophy2 knight1 rank1) (for-claim trophy2 pavilion1 rank0)
   goals met: 4 of 5
35. (ride knight1 pavilion1 keep3)
   deleted: (posted-at knight1 pavilion1)
   added: (posted-at knight1 keep3)
   goals met: 4 of 5
36. (stash trophy2 knight1 keep3 rank0 rank1 rank2 rank3)
   deleted: (carried trophy2 knight1 rank1) (kept trophy2 rank2)
   added: (carried trophy2 knight1 rank0) (kept trophy2 rank3)
   goals met: 5 of 5
